Repository: shmygov/browsenextfile
Catalog: src/browsenextfile/ui/i18n/locale/*/LC_MESSAGES/nextfile.po
Languages: ru

source: Usage:
ru: Как пользоваться:

source: View local files (images or videos) using the browser. Change to next or previous file in the directory by mouse click.
ru: Просматривать локальные файлы на компьютере (изображения или видео) при помощи веб-браузера. Переходить к следующему или предыдущему файлу в директории можно, кликая мышью.

source: Navigate to any local file (In Firefox press "Alt" key to open the browser menu and choose File--Open File. In Chrome and Edge press "Ctrl+O". Or click "Open" button on the upper side of the screen).
ru: Перейдите на любой локальный файл на компьютере (В браузере Firefox нажмите клавишу "Alt", чтобы открыть меню браузера, и выберите Файл--Открыть файл. В браузерах Chrome или Edge нажмите клавишу "Ctrl+O". Или кликните мышью на кнопке "Открыть" в верхней части экрана).

source: To open next file in the directory, click ">" button on the right side of the screen.
ru: Чтобы открыть следующий файл в директории, кликните мышью на кнопке ">" в правой части экрана.

source: To open previous file in the directory, click "<" button on the left side of the screen.
ru: Чтобы открыть предыдущий файл в директории, кликните мышью на кнопке "<" в левой части экрана.

source: To zoom in, click "+" button at the bottom of the screen, or drag the image down with the middle mouse button (wheel) pressed.
ru: Чтобы увеличить изображение, кликните на кнопке "+" в нижней части экрана, или потяните изображение мышью вниз при нажатой средней кнопке мыши (колёсике).

source: To zoom out, click "-" button at the bottom of the screen, or drag the image up with the middle mouse button (wheel) pressed.
ru: Чтобы уменьшить изображение, кликните на кнопке "-" в нижней части экрана, или потяните изображение мышью вверх при нажатой средней кнопке мыши (колёсике).

source: To scroll the image, use scroll bars, or drag the image with the left mouse button pressed.
ru: Для прокрутки изображения пользуйтесь полосами прокрутки, или перемещайте изображение мышью при нажатой левой кнопке мыши.

source: Go to the next image of the gallery
ru: Перейти к следующему изображению в галерее

source: Go to the previous image of the gallery
ru: Перейти к предыдующему изображению в галерее

source: Zoom out (or drag UP with mouse wheel pressed)
ru: Уменьшить изображение (можно также потянуть изображение мышью ВВЕРХ при нажатом колёсике мыши)

source: Zoom in (or drag DOWN with mouse wheel pressed)
ru: Увеличить изображение (можно также потянуть изображение мышью ВНИЗ при нажатом колёсике мыши)

source: Open
ru: Открыть

source: Change directory and select a file
ru: Перейти в другую директорию и выбрать файл

source: Show usage information
ru: Показать информацию о том, как пользоваться программой

source: Close the window
ru: Закрыть окно

source: Select directory
ru: Выбрать директорию

source: Select language
ru: Выбрать язык
